# Part 1 Answers:

### Answer 3: Import your analysis libraries, as well as your new customer data set as a dataframe.

In [1]:
# Import the libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Create a path variable
path = r'C:\Users\sands\Documents\01-2022 Instacart Basket Analysis'

In [3]:
# Import the customers dataset
df_cust = pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'), index_col = False)

### Answer 4: Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

In [4]:
# Rename the Surname column to Last Name
df_cust.rename(columns = {'Surnam' : 'Last Name'}, inplace = True)

In [5]:
# Change the case of STATE to Camel case
df_cust.rename(columns = {'STATE' : 'State'}, inplace = True)

In [6]:
# Change the n_dependants column name to number_of_dependants
df_cust.rename(columns = {'n_dependants' : 'number_of_dependants'}, inplace = True)

In [7]:
# Change the fam_status to marital_status
df_cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [8]:
# Check the updated column names
df_cust.head(5)

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

### Answer 5:	Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [9]:
# Convert the user_id column's type to String 
# df_cust['user_id'] = df_cust['user_id'].astype('str')

In [10]:
# Check the updated column type
df_cust['user_id'].dtype

dtype('int64')

In [11]:
# Check for Mixed datatypes
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

First Name

In [12]:
# Change the datatype of the column to string
df_cust['First Name'] = df_cust['First Name'].astype('str')

Column First Name has mixed datatypes which is fixed now

In [13]:
# Find Missing Values
df_cust.isnull().sum()

user_id                 0
First Name              0
Last Name               0
Gender                  0
State                   0
Age                     0
date_joined             0
number_of_dependants    0
marital_status          0
income                  0
dtype: int64

No null values in the dataset

In [14]:
# Find Duplicate Values
df_dups = df_cust[df_cust.duplicated()]

In [15]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, date_joined, number_of_dependants, marital_status, income]
Index: []

No duplicate values in the dataframe

In [16]:
# Check the shape of this cleaned dataframe
df_cust.shape

(206209, 10)

In [17]:
# Export and save the cleaned file
df_cust.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'customers_cleaned.pkl'))

### Answer 6:	Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

In [18]:
# Import the orders_products dataset
df_ords_prods = pd.read_pickle(os.path.join(path,'02 Data','Prepared Data', 'ords_prods_merged.pkl'))

In [19]:
# Check the datatype of user_id column
df_ords_prods['user_id'].dtype

dtype('int64')

In [22]:
# check the shape of the two datasets before merge
df_ords_prods.shape

(32404859, 20)

In [23]:
df_cust.shape

(206209, 10)

In [24]:
# Merge the two datasets on user_id key
df_merged = df_cust.merge(df_ords_prods, on = 'user_id', indicator = True)

In [25]:
df_merged.head(5)

,user_id,First Name,Last Name,Gender,State,Age,date_joined,number_of_dependants,marital_status,income,...,aisle_id,department_id,prices,prices_range_loc,busiest days,busiest_period_of_day,loyalty_flag,spending_flag,order_frequency_flag,_merge
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Busiest day,Most Orders,New Customer,Low Spender,Regular Customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Regularly busy,Most Orders,New Customer,Low Spender,Regular Customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,77,7,9.0,Mid-range product,Busiest day,Most Orders,New Customer,Low Spender,Regular Customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-range product,Regularly busy,Most Orders,New Customer,Low Spender,Regular Customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665,...,120,16,12.6,Mid-range product,Least busy,Most Orders,New Customer,Low Spender,Regular Customer,both

In [26]:
# Check that the merge is done correctly
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [27]:
# Check the shape of the merged dataset
df_merged.shape

(32404859, 30)

In [28]:
# check the columns in this merged dataframe
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                  Dtype
---  ------                  -----
 0   user_id                 int64
 1   First Name              object
 2   Last Name               object
 3   Gender                  object
 4   State                   object
 5   Age                     int64
 6   date_joined             object
 7   number_of_dependants    int64
 8   marital_status          object
 9   income                  int64
 10  order_id                int64
 11  order_number            int64
 12  orders_day_of_week      int64
 13  order_hour_of_day       int64
 14  days_since_prior_order  float64
 15  product_id              int64
 16  add_to_cart_order       int64
 17  reordered               int64
 18  Unnamed: 0              int64
 19  product_name            object
 20  aisle_id                int64
 21  department_id           int64
 22  prices                  float64
 23  prices_range_loc        object
 24  busiest days            object
 25  busiest_period_of_day   object
 26  loyalty_flag            object
 27  spending_flag           object
 28  order_frequency_flag    object
 29  _merge                  category
dtypes: category(1), float64(2), int64(14), object(13)
memory usage: 7.3+ GB

### Answer 8:	Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [29]:
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'Instacart_merged_data_0126.pkl'))